# Импорт функции получения случайных чисел
# из модуля random.
from random import randint
# Получаем случайное число в диапазоне от 1 до 100.
number = randint(1, 100)
print('Угадайте число от 1 до 100')
while True:
    guess = int(input('Введите число: '))
    # Если число меньше загаданного...
    if guess < number:
        print('Ваше число меньше того, что загадано.')
    elif guess > number:
    # ...выводим сообщение.
        print('Ваше число больше того, что загадано.')
    # Если число угадано...
    elif guess == number:
    # ...прерываем выполнение программы и...
        break
    # ...выводим сообщение.
print('Отличная интуиция! Вы угадали число :)')